//other
$(function() {  
    $('#dt1').html("牡羊座個性急切，做事講求效率，行動力十足，說做就做，創造性佳，但有時做事三分鐘熱度、缺乏耐性，且過於衝動，容易讓人產生欠缺思慮的不良印象。");  
    $('#dt2').html("金牛個性趨於保守、務實且傳統。生活較重視物質層面，做事刻苦耐勞，耐力過人。不過有時會給人固執不知變通、做事刻板的感覺，甚至可能有物慾的傾象。"); 
    $('#dt3').html("具有人雙子座個性具洞悉情勢、善於溝通、機智過人、應變能力強的特質，做事不夠專注，喜愛談論八卦，甚至膚淺的印象。際溝通以及社交關係的聰慧能力"); 
    $('#dt4').html("巨蟹座個性偏好在固定範疇內行事以求得保護與安全感，常是家庭的守護者，家庭意識深厚，若無法受到保護與慰藉時，排外性、防衛心、退縮閉塞的特質。"); 
    $('#dt5').html("獅子座個性較為自我，喜愛成為團體的中心或焦點，自尊心強烈，具有領導潛能與優越感，為了吸引它人目光，有時容易過度表現、行為誇張。"); 
    $('#dt6').html("處女座個性善於分析整理、識人之明、個性細膩，並追求完美，但當面對無法解構渾沌無規則可循的事物時，常顯現神經質與嘮叨不休的個性。"); 
    $('#dt7').html("天秤座個性對任何事物抱持著平衡的態度，性格著重公平客觀，對藝術有良好鑑賞力，但有時為取得平衡，容易表現出優柔寡斷的負面形象。"); 
    $('#dt8').html("天蠍座個性善於守密，個性沈穩，意志力堅強，深謀遠慮，天蠍座也很容易多疑，善妒，佔有慾強，報復心重，甚至有時會有縱慾的傾向。"); 
    $('#dt9').html("射手座個性喜愛思考探索與追尋哲理，個性樂觀，富理想，好自由，有時常粗心大意，一副無所謂的樣子，甚至有時會有過度樂觀的傾向。"); 
    $('#dt10').html("魔羯座個性具有堅毅的耐力，務實的態度，作事一步一腳印，個性嚴謹、守紀律，有時會表現出冷漠、憂鬱、悲觀、壓抑、欠缺浪漫與不易溝通的特質。"); 
    $('#dt11').html("水瓶座個性獨立且自主，富有創意與研究精神，但有時因想法標新立異、顛覆傳統，不容易與人群融合，會給人一種獨行俠或不合群的印象。"); 
    $('#dt12').html("雙魚座個性包容力強，富有直覺，悲天憫人，容易與人相處，但有時作事缺乏原則，容易受騙上當，甚至有時會有自我催眠或自我欺騙的負面傾向。"); 
  });

$(function() {  
    $('#h2_1').html("牡羊座"); 
    $('#h2_2').html("金牛座"); 
    $('#h2_3').html("雙子座"); 
    $('#h2_4').html("巨蟹座"); 
    $('#h2_5').html("獅子座"); 
    $('#h2_6').html("處女座"); 
    $('#h2_7').html("天坪座"); 
    $('#h2_8').html("天蠍座"); 
    $('#h2_9').html("射手座");
    $('#h2_10').html("魔羯座");  
    $('#h2_11').html("水瓶座");
    $('#h2_12').html("雙魚座"); 
  });  
//gallery  
$(function() {  
    $('#h3_1').html('<font color="#CE5D04">第一名 天蠍座：翻轉土逆 85 分</font>');
    $('#h3_2').html('<font color="#CE5D04">第二名 處女座：翻轉土逆 80 分</font>');
    $('#h3_3').html('<font color="#CE5D04">第三名 金牛座：翻轉土逆 75 分</font>');
  });  
$(function() {  
    $('#ga_1').html("相信直覺、面對內心不安，就是收獲的開始，天蠍在土逆期間，會不斷檢視自己是誰、目前的專業夠不夠、投資方向對不對，但天蠍們做就對了，多多尋問身旁的專業人士，能獲得不錯的建議。投資也是，相信自己的直覺，做了就會有不同的回應，讓天蠍更確定自己的方向。");
    $('#ga_2').html("縱使失去，但更能聚焦自己要的是什麼，處女在工作上千方百計想要證明自我，卻越搞越累，但處女在這次土逆要記得，雖然在工作或投資上有些問題發生，甚至會失去些什麼，但都在幫處女刪減不需要的工作跟投資，幫自己聚焦在對的地方，提升賺錢機會與自我價值。");
    $('#ga_3').html("突破現況開始創新，財運就會降臨，金牛在這次土逆，真的要開始展開新的冒險跟嘗試了，不過，守舊的金牛可能會不斷思考下一步，建議金牛破除舊方法，接納全新的想法，剛開始不被認同會感到孤單，但土逆結束後，財運上會有新的開始跟收入。");
  }); 
//clothes
$(function() {  
  $('#clo_1').html("粉紅色是今年的幸運顏色，衣著要以女性化為主，突顯有女人味的一面。所以除了粉色系色調外，連身裙、性感外穿內衣加外套、絲質恤衫等，只要展露女性優美的一面，再加一雙高跟鞋，都是很有魅力。");
  $('#clo_2').html("個性有很多種，活潑、斯文、好動、單純、沉默寡言、爽朗、多愁善感等，就從性格去入手，以衣著打扮來表達自己是一個怎樣的人，將喜歡的風格成為主軸。");
  $('#clo_3').html("性感神秘的打扮會是新一年的幸運衣著，性感的定義可以有很多，並不代表著得越少布越好，反而是將女性的線條美展露出來，更有魅力。質料可以是蕾絲或較薄紗的，雖然幸運色是橙色及鮮艷的顏色。");
  $('#clo_4').html("自信的穿搭，就是不盲目追隨潮流，穿上身的衣服都是令你舒服開心的，要多試試不同的配搭來襯托出個人風格。所以幸運色是紅色，質料可以更較挻身，雖然是有點搶眼，但能夠一試。");
  $('#clo_5').html("愛惹人注目的獅子座，千萬不要標奇立異去突出自己，始終屬於創作型的你，要突顯個性總有很多方法，鬆身潔淨的衣著打扮讓你身心都感到舒適，白色有令你感到平靜及無受污染般。");
  $('#clo_6').html("一向衣著都較為保守的處女座，繼續按你的衣著品味去選擇，但就不要有太多黑色或灰色，欠缺生氣；耀眼的顏色是有幫助的。此外心形圖案可以今年的幸運花紋，再多配搭一些心形的配件如腰帶領巾等。");
  $('#clo_7').html("雙腳要爪緊大地，才能夠屹立不倒。建議選擇森林系服飾，以天然、低碳、簡潔、隨意等元素為主軸，穿著較窄身的上身，相反下身可以是鬆身的，凝造出上輕下重的感覺，簡單不造作不突出。");
  $('#clo_8').html("紫色會是幸運顏色，想有文學氣息，恤衫、衛衣、牛仔褲就是你的優閒服選擇，再配上單肩包或手提電腦，予人一種單純、清新及有親和力的感覺，不要揀那些太老成的設計。");
  $('#clo_9').html("魅力可以好簡單，如復古洋裝、大蓬袖上衣配短褲、素色衣服配鮮色手袋襪子等。有兩個顏色可以多穿，藍色或白色，亦可以花多些心思在服飾配搭或飾物，尤其是頸部的裝飾。");
  $('#clo_10').html("需要找到工作及個人生活平衡的一年，嘗試在對比顏色或設計上下點功夫，有幸運星的支持，可以多選擇一些深色系以外的顏色，例如紫搭黃，又或者紅配藍，吸引別人的注意力到你身上。");
  $('#clo_11').html("發揮你的想像力，要跟花草樹木做好朋友，紫色是主調顏色。可以選擇植物的圖案，物料是天然無害的，提升身體的觸覺，亦不要被太多緊身的衣服局限你去感受跟外在世界的連結。");
  $('#clo_12').html("配搭可以是鬆身的下身配以短外套或高領上衣，波鞋或平底鞋都可以，再配上時尚皮帶或大耳環，令人耳目一新，黃色是你的幸運顏色，或者再配搭其他淺色系的顏色，都可帶來平靜愉悅的感覺。");
}); 
//numeral 
$(function() {  
  $('#h2_1a').html("3、7、22"); 
  $('#h2_2a').html("1、18、19"); 
  $('#h2_3a').html("2、11、18"); 
  $('#h2_4a').html("6、20、33"); 
  $('#h2_5a').html("1、8、17"); 
  $('#h2_6a').html("3、6、11"); 
  $('#h2_7a').html("4、13、22"); 
  $('#h2_8a').html("9、18、27"); 
  $('#h2_9a').html("8、11、19");
  $('#h2_10a').html("5、14、25");  
  $('#h2_11a').html("7、9、18");
  $('#h2_12a').html("1、7、10"); 
}); 
$(function() {  
  $('#nu_1').html("一向在關係上都較主導的你，要懂得看別人眉頭眼額，嘗試多留意身邊出現的人所為你帶來的影響力，是你的就是你的，不是你的就要放手。幸運數字是3、7、22，顏色是粉紅色或紫色。"); 
  $('#nu_2').html("成功背後不一定要擁有很多財富，能夠做自己才是最幸福。1、18、19會是你的幸運數字，而綠色及淺黃色會是新一年的幸運顏色。"); 
  $('#nu_3').html("嘗試多從別人的身上去學習你沒有的優點，保持謙卑，有需要改變自己時，也就去改變。幸運數字是2、11、18，顏色會是橙色及綠色。"); 
  $('#nu_4').html("建立屬於你的人際網絡，當能夠成為一個為自己負責任的人，真正屬於你的結果即將出現。幸運數字是6、20、33，顏色會是紅色及靛藍色"); 
  $('#nu_5').html("不要怕辛苦，要再過多一年才能夠跳出勞碌的生活，所以還需要以正面的態度去面對，吃有益的及多做運動，要跟健康的身體做好朋友。幸運數字是1、8、17，顏色是白色及珍珠色。"); 
  $('#nu_6').html("在投資方面是有一點運氣，但相對下努力得回來的結果才是最永恆的，你要知道所有事情都要取得平衡，才是最穩固。幸運數字是3、6及11，顏色會是橙色或黃色。"); 
  $('#nu_7').html("發揮更多創意，因為這樣才能夠突出你的與眾不同，不要再只討好身邊的人，要成為最真實的你，才會得到自由。幸運數字是4、13、22，顏色是黑色或啡色。"); 
  $('#nu_8').html("縱使感情關係上有什麼變化，也不要想得負面，因為舊有不適合你的人或事要離去，才有空間讓新的開始出現。幸運數字是9、18、27，顏色是紫色或金色。"); 
  $('#nu_9').html("今年有些事情的發生，會驅使你去改變，但一切都是要考驗你的自信，相信自己有多少價值，來決定結果。幸運數字是8、11、19，顏色是白色或藍色。2"); 
  $('#nu_10').html("做一個開心的人，比做一個悲觀的人更有運氣，既然有能力吸引好的事情來發生，那就只做你想做的事了。幸運數字是5、14、25，顏色是藍色和黑加白色。"); 
  $('#nu_11').html("不要投訴這個世界是不公平的，因為路是要靠自己行出來的，這一年是要默默付出的一年。幸運數字是7、9、18，顏色是綠色和紫色。2"); 
  $('#nu_12').html("要對前景有信心，嘗試學習抽離情緒的方式去思考，這對雙魚座雖然是有點難，我們就是要讓自己跟別人不一樣，突出自己。幸運數字是1、7、10，顏色是紅色或黃色。"); 
}); 
//article
$(function() {  
  $('#h2_1c').html("粉色系公事包"); 
  $('#h2_2c').html("日記本"); 
  $('#h2_3c').html("二合一的鎖匙扣"); 
  $('#h2_4c').html("甲塗上鮮紅色"); 
  $('#h2_5c').html("珍珠"); 
  $('#h2_6c').html("項鍊"); 
  $('#h2_7c').html("黑色鞋"); 
  $('#h2_8c').html("手機"); 
  $('#h2_9c').html("藍色的領巾");
  $('#h2_10c').html("黑白色瑪瑙");  
  $('#h2_11c').html("天然香水");
  $('#h2_12c').html("檸檬水"); 
});
$(function() {  
  $('#kn_1').html("因為白羊座今年陽性（男性）的能量較強，如果在欠缺陰性（女性）的能量下，在工作或感情關係上會容易失去平衡，有過份主導的情況出現，所以粉紅色會是你的幸運顏色。從來沒有懷疑白羊座的自信心，而今年幸運星在你的事業宮，粉紅色也是有利人緣的顏色，這顏色可為工作吸引更好的人際網絡。隨身幸運物可以是粉紅晶的裝飾，如果你覺得太過女性化，或者買一個粉色系的公事包陪你每天上班，都是一個選擇。"); 
  $('#kn_2').html("外遊的機會明顯增加，所以凡能夠整理好去旅行的物件或資訊，都是對你有利。不過遊萬里路除了可放鬆身心及吃買玩外，增廣目聞才是最重要。一本為2020年而設的旅遊日記會是一個好開始，隨了可記錄到不同地方的所見所聞外，還可以訓練你的藝術細胞，以不同的方式將旅遊中美好的回憶留下，是一個很好玩而且很有意思的玩意，隨時因為盡情投入每次旅遊當中，讓意想不到的結果出現。想成為一個與別不同的你，就由旅遊日記開始。"); 
  $('#kn_3').html("在較為有壓力的日子裡，要懂得找方法去釋放負能量或是不開心的情緒，而在新一年要找一個能夠跟你共同進退的人亦不容易。今年的目標，就是要跟另一半的情感連結，性可以是兩人情慾的交流，而在親密關係相處中，有開心愉悅的感覺才是最重要。一些能夠跟你最愛的另一半分享的物件，可讓你無時無刻都相念對方的都可帶來幸運，例如是二合一的鎖匙扣，或者是情侶介指等，都有心連心的感覺，顏色可以是橙色，目的是能為你帶來更多勃勃朝氣"); 
  $('#kn_4').html("是要加強自信的一年，學習不再將情緒寄託在別人身上，而是跟自己的情緒好好相處。勇氣是需要的，巨蟹座會因為害怕、恐懼而不敢去做某些事情，不敢去看自己脆弱的一面，不敢去反對你認為不對的人。人際關係是今年的焦點，所以很難可以避開人與人之間相處的重要性，與其要迅速成長，倒不如跟一個你認為值得信賴的人，從對方身上去學習你沒有的優點、好處。要提升自信心、勇氣、內在權威的顏色是紅色，或者骨頭形狀的飾物也不妨一戴，如果可以每天將指甲塗上鮮紅色，就是天天提升個人自信的最佳提示。"); 
  $('#kn_5').html("要多留意健康，因為越是強大的身體，當生病的時候可能會變得越有侵略性，所以要照顧好自己，才有氣力去做你想做的事。今年獅子座需要有一些外在的力量去保護自己，除了在工作上會有機會改變外，每日的生活亦會變得勞勞碌碌，怕沒有時間去做運動。白色有潔淨及保護的作用，所以除了多穿白色的衣服外，月亮也能夠為獅子座帶來平衡，凡是月亮形狀，又或是珍珠等的飾物，都是有輔助作用。"); 
  $('#kn_6').html("要加強人緣運，因為幸運星今年就在處女座的戀愛宮，尤其是單身的你，必須要把握這些難得的機會。要留意對別人的期望，跟真實世界之間的落差，否則令自己不開心的有可能就是自己。加強內在自我的力量，所以綠色這屬於心的顏色會帶來好運，隨身幸運物可以是有心形圖案的飾物，又或者戴一些長度剛好至心口位置的吊咀項鍊，讓你身心得到平衡，明白付出與收穫成正比的重要性。如果有想身體更健康的你，多接觸大自然或學習瑜伽都是令身心更平穩的好方法。"); 
  $('#kn_7').html("因為全年的焦點都是跟家庭、或鞏固根基有關，所以能夠有一個穩定的家，有穩定的心情，會是好運的源頭。首先規律的生活會是有幫助，如果一切都在你預期之內，你對未來會有多一點信心，黑色會是令你成熟變得穩重的顏色，或者由一雙黑色鞋開始，感覺下身的重力，要腳踏實地，很多事情都不再只是流於思考層面，而是親力親為，努力為自己爭取結果，又或者在家裡種一些泥土的植物也有幫助。"); 
  $('#kn_8').html("有利學習進修的一年，有想為自己增值的天蠍座，不妨考慮重返校園，又或者跟一些好老師學習一門新的知識。要提升思考能力及邏輯思維變得重要的一年，理解能力可能比直覺力會為你更帶來幸運，所以人生智慧今年對天蠍座來說會是很重要。紫色會是幸運顏色，隨身幸運物亦可以有很多，如眼鏡、聽音樂的耳機、電子產品如手機等，都是有助你接觸外在世界，看得更遠的物件，要變得聰明除了靠一些幸運物，主動去接觸身邊的新事物亦很重要。"); 
  $('#kn_9').html("有好消息但又有壞消息的一年，幸運星踏入你的財富宮本應是開心的事，但同時間給予壓力的土星都在財富宮，所以要辛苦付出才得到世間財。但人馬座一向都是最幸運的星座，樂觀的你其實是不會受任何限制影響發揮。謹記要向別人多表達你的需要，對方才會知道你要的是什麼，所以凡是有助表達溝通的幸運物，都對你有利；例如藍色的領巾，藍色吊咀的項鍊或耳環，在顏色上都有助溝通，不要看少多說一句比少說一句的差別，人與人之間的相處，互相明白對方是很重要的");
  $('#kn_10').html("有幸運星木星在山羊座的日子裡，感覺是輕鬆一點，除了要訓練腦袋有更多正能量及樂觀的想法外，其實在生活中懂得如何去取得平衡才是最重要。除了工作以外，今年山羊座應該為自己去想多一點，聯想一下如果黑色的世界要加入白色才獲得平衡，黑色不再是山羊座獨有的顏色，只要有對比的顏色及設計，都可以是給你一個平衡的提示，如果想有好姻緣的你，就買一些有強烈對比顏色的裝飾或飾物放到身邊，例如黑白色瑪瑙，又或者不怕老土的話，太極圖也是一個陰陽兩極的代表。");  
  $('#kn_11').html("可能要想一些方法，讓自己跟宇宙更連結，這個對水瓶座來說可能是有點不科學不理性，但原來直覺力、超自然的力量，真的可以為水瓶座在新的一年帶來更多好運。要訓練直覺，先要學習放下頭腦，所以多接觸大自然可有助感官神經系統更敏銳一點。訓練感官包括視覺、聽覺、臭覺、觸覺等等，而且有很多不同的方法，簡單如利用一些香薰來訓練臭覺，多接觸花草樹木訓練觸覺，學習靜心訓練直覺，多發揮你的想像力，天然香水、鮮花、植物等都可以成為你的好朋友。");
  $('#kn_12').html("有認識很多新朋友的運氣，交際應酬會是頗為忙碌的一年，而跟新朋友交往已不再只是泛泛之交，而是有深度的認識，對方可以是跟你有共同興趣、共同目標，甚至志同道合，要用心去對人的一年，亦會運用很多的腦袋來跟大家在知識上交流。較理性的一年，所以不能夠再以感覺去衡量事情的對與錯，學習邏輯思維。白水晶可以幫助思維清晰，不妨放一些白水晶在辦公桌上，減少思緒紊亂。黃色是你的幸運顏色，比較有突破性的幸運物建議 – 檸檬，嘗試多喝檸檬水，促進新陳代謝也是新一年的目標，要維持有健康的身體。"); 
});


//index
$(function() {  
  $('#in_1').html("人靠衣裝，彿靠金裝，打扮得體運氣自然來。來了解於2020年怎麼樣的衣著最能令你幸運爆錶！"+'<br><font size="3"><a href="clothes.html#h2_1img">1.今年金牛座以衣著打扮來表達自己是一個怎樣的人</a></font>'+'<br><font size="3"><a href="clothes.html#h2_5img">2.愛惹人注目的獅子座，千萬不要標奇立異去突出自己</a></font>'); 
  $('#in_2').html("每個人都總有幾個特別喜歡的數字和顏色。但是，你喜歡它，不代表他會因而帶給你好運。十二星座帶來運氣的數字與顏色，不妨來看看它們是不是你喜歡的數字和顏色。"+'<br><font size="3"><a href="numeral.html#h2_4aimg">1.巨蠍座今年的幸運數字是6、20、33，顏色會是紅色及靛藍色</a></font>'+'<br><font size="3"><a href="numeral.html#h2_12aimg">2.嘗試學習抽離情緒的方式去思考，這對雙魚座雖然是有點難，我們就是突出自己。</a></font>'); 
  $('#in_3').html("2019的你運氣好嗎？好的話便把運氣帶到新一年；不好的話便看看2020年有些什麼幸運之物能給你帶來好運氣吧！"+'<br><font size="3"><a href="article.html#h2_11cimg">2.直覺力、超自然的力量，真的可以為水瓶座在新的一年帶來更多好運</a></font>'+'<br><font size="3"><a href="article.html#h2_8cimg">2.天蠍座隨身幸運物亦可以有很多，如眼鏡、聽音樂的耳機、電子產品如手機</a></font>'); 
  $('#h4_1').html('<font color="#CE5D04" size="6">2020/05/15 脈動變星U Ori達最大亮度</font>'); 
  $('#h4_3').html('宇宙中，地球人的家園位於銀河系，但銀河系絕非宇宙中唯一星系。為了更瞭解我們的宇宙組成成分、如何演化，天文學家想解答一個問題--答案卻絕沒想像中的那麼簡單：<font size="5" color="blue">宇宙裡，到底有多少個星系?</font><br><Br>'); 
  $('#h4_2').html('U Ori預計將在5月15日左右達到最大亮度，背景星空為獵戶座，於傍晚日落後出現在西方天空，最佳觀測時間約為19時(相對位置請見示意圖)，由於它的亮度目前雖比肉眼觀星極限稍高一些，但建議還是使用天文望遠鏡或雙筒望遠鏡來觀賞。它是一顆米拉變星，又稱為芻藁(ㄔㄨˊㄍㄠˇ)變星，得名於最經典米拉變星，芻藁增二，此類型的變星亮度變化很大，以U Ori為例，有紀錄以來最亮為4.8等、最暗則只有13等(均為V波段)，遠低於一般雙筒望遠鏡的極限且亮度變化週期非常長，動輒超過100天，以U Ori為例，週期為377天。<br><br>該星發現於1885年，至今已累積了130年以上的觀測資料，該星有一個超長的新週期，每隔12至15年亮度會有一個小波動，天文學家因此推測這種週期性可能代表著一顆系外行星的存在，但是目前仍沒有實際證據能夠證明其波動為系外行星所影響。<br><br>米拉變星已經屬於恆星演化晚期的紅巨星，即將噴出外層氣體形成行星狀星雲，由於這類變星的週期穩定且亮度變化大，故米拉變星是有志於觀測變星的業餘天文學家最普遍的目標。<a href="https://www.tam.museum/astronomy/">「網路天文館-天象預報」</a>'); 
});  
$(function() {  
  $('#h1_1').html('<font color="#C8EBFF">帶你星空漫遊 探索十二星座奧秘</font>');
  $('#h1_2').html('<font color="#C8EBFF">星星所守護的星座 賦予潛在天賦</font>');
  $('#h1_3').html('<font color="#C8EBFF">三個星座意外降臨好運 許願指南</font>');
});  
$(function() {  
  $('#h1p_1').html("星座的傳說、占星術都是很早之前就存在的，古老的發明如今瘋狂流行，恰恰印證了星座也是影響人們性格特點的重要因素。");
  $('#h1p_2').html("您能在宇宙中找到屬於自己的星星，每一個星宿所代表的意義與故事去表達出真正的自己，星座對生活有潛在影響力是很大。");
  $('#h1p_3').html("每個人都有一個決定性格與天賦的星盤，但主宰人生的依舊是自己而非命運，努力的時候不會輕易鬆懈，星象推動夢想成真。");
}); 
$(function() {  
  $('#a_1').html("....現在就仔細看吧!");
  $('#a_2').html("....是誰在守護您呢?");
  $('#a_3').html("....快看是哪個星座!");
}); 
$(function() {  
  $('#as_1').html('<font color="#CE5D04">跟著流行時尚就能走出好運嗎?</font>');
  $('#as_2').html('<font color="#CE5D04">您對數字語言也有特別的喜好嗎?</font>');
  $('#as_3').html('<font color="#CE5D04">您相信配戴「如意」真能招來好運嗎?</font>');
}); 

// all
$(function() {  
  $('#all').html('<img src="assets/img/images/s.gif"></a><a class="navbar-brand" href="index.html">西洋占星</a>'); 
}); 
//copyright
$(function() {  
  $('#copyright').html('&copy; D10813011 JavaScript 期末作業 &middot; <a href="copyright.html">版權說明</a> &middot; <a href="#">Terms</a>'); 
  $('#copyright_t').html("本網站所有圖片皆為網路所擷取，僅作為學習網頁製作及繳交期末作業期間所使用，不涉及任何商業活動，如涉及侵權請e-mail至d10813011@gapps.uch.edu.tw告知，本網會立即下架，謝謝!!");
});
//H1  
$(function() {  
  $('#article').html('幸運之物<font size="4" color="#CE5D04">2019的你運氣好嗎？好的話便把運氣帶到新一年；不好的話便看看2020年有些什麼幸運之物能給你帶來好運氣吧！</font>'); 
  $('#clothes').html('幸運衣著<font size="4" color="#CE5D04">人靠衣裝，彿靠金裝，打扮得體運氣自然來。來了解於2020年怎麼樣的衣著最能令你幸運爆錶！</font>');
  $('#club_course').html('星座工作戰鬥力!!');
  $('#gallery').html('2020 超前部署！這三個星座土逆意外好運');
  $('#learn_more').html('星星所守護的星座');
  $('#learn_more_1').html('你可能會時常仰望星空，對著星星訴說自己的願望，天生的繁星點點，哪一顆才是屬於自己的守護星麼？<font color="green" size="10">快點選</font>，看看風火水土守護星座吧!!');
  $('#mind_quiz').html('你對愛情是什麼滋味');
  $('#numeral').html('幸運數字與顏色<font size="4" color="#CE5D04">十二星座帶來運氣的數字與顏色，不妨來看看它們是不是你喜歡的數字和顏色。</font>');
  $('#other').html('12星座人格特質<font size="4" color="#CE5D04">也許你有一些自己都沒察覺的特質，就是吸引別人來跟你親近的關鍵，來看看每個星座最受人喜愛的優點！</font>');
  $('#random_select').html('西洋12星座');
  $('#simple_rpg').html('成功之星 ~ 專題講座');
  $('#today').html('帶你星空漫遊 探索十二星座奧秘');
  $('#youtube_player').html('YouTube 星座動畫影片');
}); 
//today
$(function() { 
  $('#h3_1a').html('<font color="#CE5D04">古代的蘇美人和希臘人建立了北方大部分的星座</font>'); 
  $('#h3_2a').html('<font color="#CE5D04">那些造訪太陽系的好鄰居</font>'); 
  $('#li_p_1').html('星座現時共有88個，皆由國際天文聯合會所定義，名字多數來源於希臘神話中的人物和動物。當時歐洲的探險家往南進發時，能夠看見一些以前看不到的星空，所以歐美天文學家加入新星座以填滿南面的天空。1922年，國際天文聯合會通過了88個星座的現代名單。在此之後，尤金·德爾波特為每個星座繪製了精確的邊界，使得天空中的每一個點都屬於一個星座。<br><br>星座沒有一定的次序，人們表示它們是通常會根據其英文名的字母序列。另外由於每個星座都有其定義下的邊界，所以有少數場合中人們會採用星座於天球上所佔有的面積來排序。星座各有不同出處，古天文學家托勒密已歸納出由古希臘神話流傳至今的星座，之後更有其他天文學家定義新的星座，那些星座不只有神話中出現的事物，而有其他動物和科學用具。<br>');
  $('#li_p').html('<li>大熊族：包括大熊座及周圍屬於北半球的星座，大多與動物有關，共有10個星座。</li><li>黃道星座：包括黃道13星座，除常見的12個傳統星座，還包含蛇夫座。</li><li>英仙族：包括英仙座以及與英仙珀耳修斯的故事有關的星座，共有9個星座。</li><li>武仙族：包括武仙座以及與武仙海格力斯的故事有關的星座，共有18個星座。</li><li>獵戶族：包括獵戶座與及獵人俄里翁的兩隻獵犬及獵物，共有5個星座。</li><li>幻之水族：包含一些與海洋有關的星座，大部分都在南半球，共有9個星座。</li><li>拜耳族：由天文學家約翰·拜耳命名的星座，大多與動物有關，共有11個星座。</li><li>拉卡伊族：由天文學家尼可拉·路易·拉卡伊命名的星座，大多都是科學的用具，共有13個星座。</li>'); 
  $('#li_p_2').html('大約每50,000年，就會有一顆恆星行經太陽系附近，一般來說不會造成意外，但有時會點亮夜空，或是擾動歐特雲（Oort Cloud）中的冰天體，掉入太陽系形成彗星。這些來訪的恆星當中，最著名的就是「舒爾茨星」，這個小型雙星系統於2013年被發現。它的軌道路徑顯示，大約在70,000年前曾經穿過歐特雲。有些天文學家也認為，舒爾茨星通過時可能會將一些冰天體撞入內太陽系。<br><br><p>不過舒爾茨星總質量僅0.15倍於太陽，速度也相當快，對太陽系的影響並不大。最近天文學家發現，類似舒爾茨星的飛掠，可能比預期的多。在NASA JPL工作的Eric Mamajek發現舒爾茨星的軌道特性後，天文學家便繼續在找尋這種特別的恆星。2018年，德國普朗克研究所的Coryn Bailer-Jones等研究人員使用ESA的「蓋亞任務」，繪製未來太陽與其他恆星的軌道。他們發現將近700顆恆星，在接下來的1,500萬年中，將從太陽系15光年內的距離通過。<br><p>但團隊認為大多數的飛掠事件還沒發現。他們推測，每100萬年大約有20顆恆星會在幾光年的距離內通過。根據計算，約136萬年後，一顆名為Gliese 710的恆星將在10,000 AU的距離飛掠，進入歐特雲的範圍內。Gliese 710的質量約太陽的一半，造成的影響將比舒爾茨星大得多。這可能會是太陽系一生中遇到最重量級的訪客，但對於內部太陽系的影響並不會太大，即便Gliese 710使大量歐特雲的天體掉入內太陽系，也得花上數百萬年的時間才會到達地球附近。對於那時的人類最大的影響可能只有橘紅色的Gliese 710成為夜空中最亮的恆星。（編譯／虞景翔）');
}); 



 